# people = [
#          ('이호준', '01050442903'),
#          ('이호상', '01051442904'),
#          ('이준호', '01050342904'),
#          ('이호준', '01050442903'),
#          ('이준', '01050412904'),
#          ('이호', '01050443904'),
#          ('이호준', '01050442903'),
#          ]

# people_set = set(people) # people 리스트를 set형태로 변환 set은 중복과 순서가 없음
# print(people_set)

people = [
         ('이호준', '01050442903'),
         ('이호상', '01051442904'),
         ('이준호', '01050342904'),
         ('이호준', '01050442903'),
         ('이준', '01050412904'),
         ('이호', '01050443904'),
         ('이호준', '01050442903'),
         ]
newlist = [] # 새로운 리스트를 만들고
for i in people: # i에 기존 리스트를 받아서
    if i not in newlist: # 새 리스트에 기존 리스트가 없다면
        newlist.append(i) # 새 리스트에 추가
print(newlist)